{
    "_name_or_path": "distilbert-base-uncased",
    "activation": "gelu",
    "architectures": [
        "DistilBertForSequenceClassification"
    ],
    "attention_dropout": 0.1,
    "dim": 768,
    "dropout": 0.1,
    "hidden_dim": 3072,
    "id2label": {
        "0": "Business&Money",
        "1": "Crime&Legal",
        "2": "Entertainment&Arts",
        "3": "Lifestyle",
        "4": "SciTech&Education",
        "5": "Society&Religion",
        "6": "Sports&Health",
        "7": "Travel&Food",
        "8": "World&Politics"
    },
    "initializer_range": 0.02,
    "label2id": {
        "Business&Money": 0,
        "Crime&Legal": 1,
        "Entertainment&Arts": 2,
        "Lifestyle": 3,
        "SciTech&Education": 4,
        "Society&Religion": 5,
        "Sports&Health": 6,
        "Travel&Food": 7,
        "World&Politics": 8
    },
    "max_position_embeddings": 512,
    "model_type": "distilbert",
    "n_heads": 12,
    "n_layers": 6,
    "pad_token_id": 0,
    "problem_type": "single_label_classification",
    "qa_dropout": 0.1,
    "seq_classif_dropout": 0.2,
    "sinusoidal_pos_embds": false,
    "tie_weights_": true,
    "torch_dtype": "float32",
    "transformers_version": "4.35.2",
    "vocab_size": 30522
}
